app/Controllers/AgendaController.php

    public function index(): mixed
    {
        try {
            $model = new AgendaModel();

            // Ambil kata kunci pencarian dari input form
            $search = $this->request->getGet('search');

            if ($search) {
                // Jika ada kata kunci pencarian, lakukan pencarian berdasarkan judul atau nomor
                $data['agendas'] = $model->like('judul', $search)
                                          ->orLike('nomor', $search)
                                          ->findAll();
            } else {
                // Jika tidak ada kata kunci, tampilkan semua data
                $data['agendas'] = $model->findAll();
---
SELECT *
FROM `agenda`
WHERE `judul` LIKE '%test%' ESCAPE '!'
OR  `nomor` LIKE '%test%' ESCAPE '!'
SELECT *
FROM `agenda`

    public function update($id)
    {
        $model = new AgendaModel();
        $existingAgenda = $model->find($id);
---
SELECT *
FROM `agenda`
WHERE `agenda`.`id` = '17'